let Enum = {
    ActionTime:{
        READY: 20 * 1000,
        PLAY:20*1000
    },

    shouPaiValue:{
        1: 1200,
        2: 1000,
        3: 800,
        4: 600,
        5: 300,
        6: 250,
        7: 225,
        8: 220,
        9: 180,
        10: 130,
        11: 80,
        12: 50,
        13: 20,
        14: 10,
        15: 5,
        16: 2,
        17: 1
    },
    // (牌分) 备注: 这里的14也是A
    paiValue:{
        3: 1, 4:2, 5:3, 6:4, 7:5, 8:6, 9:7, 10:8, 11:9, 12:10, 13:11, 14: 13, 1:13, 2: 20, 514: 25, 614: 40
    },
    // 牌型分
    typeValue:{
        dan:0,
        dui:{1 : 3, 2: 20, 3: 40, 4: 50, 5 : 60, 6 : 100, 7: 200, 8: 400, 9 : 600, 10: 800},
        san:{1 : 30,2: 70, 3: 100, 4 : 200, 5 : 400, 6: 800},
        four: 100,
        shun:{"5":27, "6": 40, "7": 50, "8":70, "9": 100, "10":130, "11": 150, "12":200,"13":500}
    },
    // 牌型
    shape:{"DAN": 1,"DUI":2,"SAN_YI":3,"SHUN":4,"SI_ER":5,"ZD":6},
    // 带牌定义
    subShape:{"NONE":0, "DAN": 1,"DUI": 2},
    // 托管时间
    CANCELHOSTED:2,
    // 机器人自动走牌时间
    rebotAutoGrabTime :1,
    // 要不起倒计时
    noRise : {"FK":10,"JB":10},
    // 第一次出牌时间
    firstPlayTime : {"FK":15, "JB":15},
    // 自动走牌时间
    autoPlayTime:{"FK":10,"JB":10},
    // 走牌状态
    doCard: {"NONE": 0, "PLAY":1, "PASS": 2},
    // 销毁房间的状态 NONE 的值不能变成0以外的
    DestroyState:{NONE:0, YES:1, NO:2, FQ:3},
    // 房间状态
    GameState:{READY:1,PLAY:2},
    // 房间销毁倒计时
    ROOM_VOID_TIME:120,
    // 房间金豆街结算倍率
    ROOM_BILL_BEAN: {
        1: {1: {1: 0, 5: 1, 9: 2, 15: 4, 16: 6}, 2: {1: 0, 5: 1, 9: 2, 12: 4, 13: 6}},
        2: {1: {1: 0, 5: 2, 9: 4, 15: 6, 16: 8}, 2: {1: 0, 5: 2, 9: 4, 12: 6, 13: 8}}
    },
    // 炸弹对应的倍数
    ZD_MUIT:{
        1:{normal:4, spe2:6},
        2:{normal:6, spe2:8}
    },
    // 赢得底分的x倍发布插播消息
    NOTICE_MAX_BET:12,
    // 准备阶段倒计时
    READY_SECOND:{"FK":2000, "JB":20}
};

module.exports = Enum;
